In [1]:
import pandas as pd
import numpy as pd

In [2]:
import pandas as pd
import numpy as np

In [3]:
dict={
    "Name":['Rajesh','Anubhav','Rahul','suresh'],
    "Marks":[76,46,97,49],
    "City":['GGN','UP','DELHI','UP']
}

In [4]:
df=pd.DataFrame(dict)

In [5]:
df

      Name  Marks   City
0   Rajesh     76    GGN
1  Anubhav     46     UP
2    Rahul     97  DELHI
3   suresh     49     UP

In [6]:
df.to_csv('name.csv')

In [7]:
df.to_csv('name.csv',index=False)

In [8]:
df.head(2)

      Name  Marks City
0   Rajesh     76  GGN
1  Anubhav     46   UP

In [9]:
df

      Name  Marks   City
0   Rajesh     76    GGN
1  Anubhav     46     UP
2    Rahul     97  DELHI
3   suresh     49     UP

In [10]:
df.describe

<bound method NDFrame.describe of       Name  Marks   City
0   Rajesh     76    GGN
1  Anubhav     46     UP
2    Rahul     97  DELHI
3   suresh     49     UP>

In [11]:
df..index=['first','second']

SyntaxError: invalid syntax (2859068892.py, line 1)

In [ ]:
df.index=['first','second']

In [ ]:
df

In [ ]:
        df..index=['first','second','third','fourth']

In [ ]:
df.index=['first','second','third','fourth']

In [ ]:
df

In [ ]:
 ser = pd.seris

In [ ]:
ser = pd.series(np.random.rand)

In [ ]:
ser = pd.Series(np.random.rand)

In [ ]:
ser

In [12]:
ser = pd.Series(np.random.rand(50))

In [13]:
ser

0     0.778578
1     0.110250
2     0.134304
3     0.645670
4     0.123875
5     0.584351
6     0.538397
7     0.822090
8     0.284502
9     0.600819
10    0.781662
11    0.290263
12    0.355333
13    0.940674
14    0.308888
15    0.635709
16    0.922646
17    0.283867
18    0.142297
19    0.255362
20    0.083179
21    0.365792
22    0.367117
23    0.667623
24    0.058570
25    0.842148
26    0.593103
27    0.760402
28    0.961059
29    0.194674
30    0.818787
31    0.154839
32    0.471097
33    0.270100
34    0.705503
35    0.590802
36    0.633869
37    0.567792
38    0.730330
39    0.120703
40    0.221268
41    0.064407
42    0.486091
43    0.911759
44    0.253194
45    0.142281
46    0.223586
47    0.016968
48    0.703120
49    0.011687
dtype: float64

In [14]:
type(ser)

pandas.core.series.Series

In [15]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [16]:
newdf

            0         1         2         3         4
0    0.874186  0.987010  0.188719  0.149374  0.380005
1    0.562203  0.159330  0.633733  0.956476  0.449394
2    0.956744  0.825853  0.029686  0.693045  0.564922
3    0.421882  0.272154  0.574152  0.239008  0.223830
4    0.735846  0.320605  0.441539  0.325847  0.937699
..        ...       ...       ...       ...       ...
329  0.855630  0.555594  0.759369  0.302819  0.092388
330  0.135296  0.407475  0.770243  0.234648  0.776292
331  0.632414  0.052208  0.922509  0.936803  0.969851
332  0.310884  0.349612  0.747052  0.703180  0.458425
333  0.667674  0.073056  0.520472  0.986933  0.994610

[334 rows x 5 columns]